Show / Hide Table of Contents
Class TendonStressLoading
Tendon stress loading
Inheritance
System.Object
TendonLoading
TendonStressLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class TendonStressLoading : TendonLoading
Constructors
Improve this Doc   View Source
TendonStressLoading()
Constructor
Declaration
public TendonStressLoading()
Properties
Improve this Doc   View Source
Stresses
Tendon stress
Declaration
public List<TendonTimeStressLoading> Stresses { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<TendonTimeStressLoading>
 Improve this Doc
 View Source